m5stack/uiflow-micropython/m5stack/boards/M5STACK_StickC_PLUS2/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "M5STACK StickC PLUS2"
#define MICROPY_HW_MCU_NAME "ESP32(SPIRAM)"

// If not enable LVGL, ignore this...
#include "./../mpconfiglvgl.h"
